intranet/app/controllers/admin_controller.rb

  def index
	@total_sites = Site.count
---
SELECT count(*) AS count_all FROM `sites`