intranet/app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `due_date`, `link`, `description`, `status`) VALUES('test', '2010-08-17 19:01:38', '2010-08-17 19:01:38', '2010-08-17 19:01:00', 'test.com', 'Testing', 0)

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 3)
UPDATE `projects` SET `updated_at` = '2010-08-18 18:56:18', `description` = 'Wyse P20 thin client computers.\r\n\r\nSynnex seems to have the right model for $458.40: http://ec.synnex.com/ecexpress/part/partTechnotes.do?skuNo=2652696&priceSet=VS&divNumber=4&frame=true&isnew=ture' WHERE `id` = 4

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1