intranet/app/controllers/sites_controller.rb

SELECT * FROM `sites` WHERE (`sites`.`id` = 0)
---
  def show
    @site = Site.find(params[:id])

SELECT * FROM `sites` WHERE (`sites`.`id` = 1)
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO `sites` (`name`, `created_at`, `added_by`, `updated_at`, `url`, `username`, `description`, `last_modified_by`, `password`) VALUES('GovDirections', '2010-07-21 22:24:52', '', '2010-07-21 22:24:52', 'http://www.govdirections.com', 'mikem@cfmotions.com', 'GovDirections collects solicitations from across North America. It charges a flat subscription fee. It does not actually host bid packets itself. Instead it links to original sources, who sometimes do not offer them electronically.', '', 'kadimah88')
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT * FROM `sites` WHERE (`sites`.`id` = 1)
UPDATE `sites` SET `updated_at` = '2010-07-22 14:22:54', `description` = 'GovDirections collects solicitations from across North America into an easily searchable database. It charges a flat subscription fee. It does not actually host bid packets itself. Instead it links to original sources, who sometimes do not offer them electronically.' WHERE `id` = 1
---
  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])