intranet/app/controllers/users_controller.rb

  def index
    @sort_by = params[:sort_by] || "level"
    @users = User.find(:all, :order => @sort_by)
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `level`) VALUES('mike', '-6179123680.716385248721241', '2010-07-22 14:02:57', '2010-07-22 14:02:57', 'cc89464489480a94a96702554ba3035f854a6219', 5)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-07-22 17:57:30', `name` = 'administrator' WHERE `id` = 7